### Data Manipulation and Analysis with pandas 


Data Manipulation and analysis are key tasks in any data science or data analysis project. Pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean, transform, and extract insights from datal.

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("data.csv")

In [6]:
## to get head of the data 
df.head(8)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West
6  2023-01-07        A   16.0  Product1  936.0   East
7  2023-01-08        C   89.0  Product1  488.0   West

In [7]:
#TO GET  the last five rows
df.tail()

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [8]:
## to get statstical info 
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [9]:
## to list all the data types 
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [12]:
## Handling missing values 
df.isnull()

     Date  Category  Value  Product  Sales  Region
0   False     False  False    False  False   False
1   False     False  False    False  False   False
2   False     False  False    False  False   False
3   False     False  False    False  False   False
4   False     False  False    False  False   False
5   False     False  False    False  False   False
6   False     False  False    False  False   False
7   False     False  False    False  False   False
8   False     False  False    False  False   False
9   False     False  False    False  False   False
10  False     False  False    False  False   False
11  False     False  False    False   True   False
12  False     False  False    False  False   False
13  False     False  False    False  False   False
14  False     False  False    False  False   False
15  False     False   True    False  False   False
16  False     False  False    False  False   False
17  False     False   True    False  False   False
18  False     False  False    False  False   False
19  False     False  False    False  False   False
20  False     False  False    False  False   False
21  False     False  False    False  False   False
22  False     False  False    False  False   False
23  False     False  False    False  False   False
24  False     False  False    False  False   False
25  False     False  False    False  False   False
26  False     False  False    False  False   False
27  False     False  False    False  False   False
28  False     False   True    False  False   False
29  False     False  False    False  False   False
30  False     False  False    False  False   False
31  False     False  False    False  False   False
32  False     False  False    False  False   False
33  False     False  False    False   True   False
34  False     False  False    False  False   False
35  False     False  False    False   True   False
36  False     False  False    False  False   False
37  False     False  False    False   True   False
38  False     False  False    False  False   False
39  False     False  False    False  False   False
40  False     False  False    False  False   False
41  False     False  False    False  False   False
42  False     False  False    False  False   False
43  False     False  False    False  False   False
44  False     False  False    False  False   False
45  False     False  False    False  False   False
46  False     False  False    False  False   False
47  False     False  False    False  False   False
48  False     False  False    False  False   False
49  False     False  False    False  False   False

In [ ]:
## to find any missing values
df.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [17]:
## to find number of missing values 
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [21]:
df_filled=df.fillna(0)

In [22]:
df_filled.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [25]:
## filling missing values with the mean of the column
df['Sales']=df['Sales'].fillna(df['Sales'].mean())
df['Value']=df['Value'].fillna(df['Value'].mean())

In [26]:
df.isnull().sum()

Date        0
Category    0
Value       0
Product     0
Sales       0
Region      0
dtype: int64

In [27]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [30]:
## renaming columns

df=df.rename(columns={'Date':'Sales Date','Product':'my product'})

In [31]:
df.head()

   Sales Date Category  Value my product  Sales Region
0  2023-01-01        A   28.0   Product1  754.0   East
1  2023-01-02        B   39.0   Product3  110.0  North
2  2023-01-03        C   32.0   Product2  398.0   East
3  2023-01-04        B    8.0   Product1  522.0   East
4  2023-01-05        B   26.0   Product3  869.0  North

In [34]:
## change the datatypes
df['Value_new']=df['Value'].fillna(df['Value'].mean()).astype(int)

In [35]:
df.head()

   Sales Date Category  Value my product  Sales Region  Value_new
0  2023-01-01        A   28.0   Product1  754.0   East         28
1  2023-01-02        B   39.0   Product3  110.0  North         39
2  2023-01-03        C   32.0   Product2  398.0   East         32
3  2023-01-04        B    8.0   Product1  522.0   East          8
4  2023-01-05        B   26.0   Product3  869.0  North         26

In [36]:
df['New Value']=df['Value'].apply(lambda x : x*2)

In [37]:
df.head()

   Sales Date Category  Value my product  Sales Region  Value_new  New Value
0  2023-01-01        A   28.0   Product1  754.0   East         28       56.0
1  2023-01-02        B   39.0   Product3  110.0  North         39       78.0
2  2023-01-03        C   32.0   Product2  398.0   East         32       64.0
3  2023-01-04        B    8.0   Product1  522.0   East          8       16.0
4  2023-01-05        B   26.0   Product3  869.0  North         26       52.0

In [38]:
### Data Aggregating and grouping 
df.head()

   Sales Date Category  Value my product  Sales Region  Value_new  New Value
0  2023-01-01        A   28.0   Product1  754.0   East         28       56.0
1  2023-01-02        B   39.0   Product3  110.0  North         39       78.0
2  2023-01-03        C   32.0   Product2  398.0   East         32       64.0
3  2023-01-04        B    8.0   Product1  522.0   East          8       16.0
4  2023-01-05        B   26.0   Product3  869.0  North         26       52.0

In [41]:
grouped_mean=df.groupby('my product')['Value'].mean()

In [42]:
grouped_mean.head()

my product
Product1    46.905585
Product2    52.800000
Product3    54.986562
Name: Value, dtype: float64

In [44]:
## group based on two categoricial data
grouped_sum=df.groupby(['my product','Region'])['Value'].mean() 
print(grouped_sum)

my product  Region
Product1    East      41.714286
            North     20.248227
            South     50.000000
            West      74.436170
Product2    East      28.000000
            North     63.500000
            South     60.333333
            West      53.500000
Product3    East      50.500000
            North     42.457447
            South     71.666667
            West      62.166667
Name: Value, dtype: float64

In [47]:
## aggergate multiple functions 
grouped_age=df.groupby('Region')['Value'].agg(['mean','sum','count'])
grouped_age

             mean          sum  count
Region
East    42.307692   550.000000     13
North   40.226306   442.489362     11
South   62.000000   496.000000      8
West    61.041371  1098.744681     18

In [60]:
### merging and joing data frames 
df1=pd.DataFrame({'Key':['A','B','C'],'Value1':[1,2,3]})
df2=pd.DataFrame({'Key':['A','B','D'],'Value2':[4,5,6]})

In [61]:
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [62]:
df2

  Key  Value2
0   A       4
1   B       5
2   D       6

In [63]:
### merge Dataframe on the 'key columns'  
pd.merge(df1,df2,on="Key",how="inner")

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [64]:

pd.merge(df1,df2,on="Key",how="outer")

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [65]:

pd.merge(df1,df2,on="Key",how="left")

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [66]:

pd.merge(df1,df2,on="Key",how="right")

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6

In [67]:

pd.merge(df1,df2,on="Key")

  Key  Value1  Value2
0   A       1       4
1   B       2       5